# IsCreatedPhaseOrderValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..IsCreatedPhaseOrderValid Method
Element Class See Also
---
Returns true if createdPhaseId and demolishedPhaseId are in order.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsCreatedPhaseOrderValid(
	ElementId createdPhaseId
)
```

Visual Basic
---
```text
Public Function IsCreatedPhaseOrderValid ( _
	createdPhaseId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsCreatedPhaseOrderValid(
	ElementId^ createdPhaseId
)
```

# ### Parameters
createdPhaseId
    Type: Autodesk.Revit.DB..::..ElementId The createdPhaseId.
# ### Return Value
True if createdPhaseId index is less than or equal to demolishedPhaseId, otherwise returns false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Element Class
Autodesk.Revit.DB Namespace